In [71]:
from google.colab import drive
# mount drive
drive.mount('/content/drive')
data_path = '/content/drive/MyDrive/cardiospike_leaders-of-digital_compet/blending/'

# update path to import module from drive
import sys
sys.path.append('/content/drive/MyDrive/cardiospike_leaders-of-digital_compet/blending/')
print(sys.path)

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).
['', '/content', '/env/python', '/usr/lib/python37.zip', '/usr/lib/python3.7', '/usr/lib/python3.7/lib-dynload', '/usr/local/lib/python3.7/dist-packages', '/usr/lib/python3/dist-packages', '/usr/local/lib/python3.7/dist-packages/IPython/extensions', '/root/.ipython', '/content/drive/MyDrive/emergency_compet/submits/', '/content/drive/MyDrive/cardiospike_leaders-of-digital_compet/blending/', '/content/drive/MyDrive/cardiospike_leaders-of-digital_compet/blending/', '/content/drive/MyDrive/cardiospike_leaders-of-digital_compet/blending/']

In [72]:
import pandas as pd
import numpy as np
from collections import Counter

In [73]:
df1 = pd.read_csv(data_path + 'submit_agg-feats_windows_6_0.71.csv', sep = ',')
print(df1.shape)
df1.head()

(15034, 3)

   id  time  y
0  81     0  0
1  81   568  0
2  81  1140  0
3  81  1716  0
4  81  2284  0

In [74]:
df2 = pd.read_csv(data_path + 'submit_agg-feats_windows_0.67.csv', sep = ',')
print(df2.shape)
df2.head()

(15034, 3)

   id  time  y
0  81     0  0
1  81   568  0
2  81  1140  0
3  81  1716  0
4  81  2284  0

In [75]:
df3 = pd.read_csv(data_path + 'submit_agg-feats_direct_revers_tpot_local_0.67.csv', sep = ',')
print(df3.shape)
df3.head()

(15034, 3)

   id  time  y
0  81     0  0
1  81   568  0
2  81  1140  0
3  81  1716  0
4  81  2284  0

In [90]:
merged = df1.merge(df2, on=['id', 'time'], how='inner')
merged = merged.merge(df3, on=['id', 'time'], how='inner')
merged

        id   time  y_x  y_y  y
0       81      0    0    0  0
1       81    568    0    0  0
2       81   1140    0    0  0
3       81   1716    0    0  0
4       81   2284    0    0  0
...    ...    ...  ...  ... ..
15029  176  44332    0    0  0
15030  176  44968    0    1  0
15031  176  45596    0    0  0
15032  176  46904    0    0  0
15033  176  48100    0    0  0

[15034 rows x 5 columns]

In [91]:
merged.columns = ['id', 'time', 'y_x', 'y_y', 'y']
merged

        id   time  y_x  y_y  y
0       81      0    0    0  0
1       81    568    0    0  0
2       81   1140    0    0  0
3       81   1716    0    0  0
4       81   2284    0    0  0
...    ...    ...  ...  ... ..
15029  176  44332    0    0  0
15030  176  44968    0    1  0
15031  176  45596    0    0  0
15032  176  46904    0    0  0
15033  176  48100    0    0  0

[15034 rows x 5 columns]

#### Binary blending

In [92]:
avg = merged[['y_x', 'y_y', 'y']].mode(axis=1)
Counter(avg[0])

Counter({0: 13208, 1: 1826})

In [94]:
merged['target_final'] = avg[0]

In [95]:
submit = merged.drop(['y_x', 'y_y', 'y'], axis=1)
submit

        id   time  target_final
0       81      0             0
1       81    568             0
2       81   1140             0
3       81   1716             0
4       81   2284             0
...    ...    ...           ...
15029  176  44332             0
15030  176  44968             0
15031  176  45596             0
15032  176  46904             0
15033  176  48100             0

[15034 rows x 3 columns]

In [96]:
submit.columns = ['id', 'time',	'y']
print(Counter(submit.y))
submit

Counter({0: 13208, 1: 1826})

        id   time  y
0       81      0  0
1       81    568  0
2       81   1140  0
3       81   1716  0
4       81   2284  0
...    ...    ... ..
15029  176  44332  0
15030  176  44968  0
15031  176  45596  0
15032  176  46904  0
15033  176  48100  0

[15034 rows x 3 columns]

In [98]:
submit.y = submit.y.astype('int')

In [99]:
submit.to_csv('submit_blend_four_corrected_norf.csv', index=False)